app/Controllers/Api/StatistikDashboardApiController.php

SELECT COUNT(*) AS `numrows`
FROM `Kelahiran`
WHERE `id_desa` = 'DESA001'
SELECT COUNT(*) AS `numrows`
FROM `Kelahiran`
WHERE `id_desa` = 'DESA001'
AND `jenis_kelamin` = 'L'
SELECT COUNT(*) AS `numrows`
FROM `Kelahiran`
WHERE `id_desa` = 'DESA001'
AND `jenis_kelamin` = 'P'
SELECT COUNT(*) AS `numrows`
FROM `Kelahiran`
WHERE `id_desa` = 'DESA001'
AND MONTH(tgl_lahir) = 5
AND YEAR(tgl_lahir) = 2026
SELECT COUNT(*) AS `numrows`
FROM `Kematian`
WHERE `id_desa` = 'DESA001'
SELECT COUNT(*) AS `numrows`
FROM `Kematian`
WHERE `id_desa` = 'DESA001'
AND MONTH(tgl_kematian) = 5
AND YEAR(tgl_kematian) = 2026
SELECT *
FROM `Lansia`
WHERE `id_desa` = 'DESA001'
---
    private function getRingkasan(string $idDesa, string $bulan, string $tahun): array
    {
        $totalPenduduk = $this->pendudukModel
            ->where('id_desa', $idDesa)
            ->countAllResults();

        $totalLakiLaki = $this->pendudukModel
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'L')
            ->countAllResults();

        $totalPerempuan = $this->pendudukModel
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'P')
            ->countAllResults();

        $totalKelahiran = $this->kelahiranModel
            ->where('id_desa', $idDesa)
            ->countAllResults();

        $kelahiranLaki = $this->kelahiranModel
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'L')
            ->countAllResults();

        $kelahiranPerempuan = $this->kelahiranModel
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'P')
            ->countAllResults();

        $kelahiranBulanIni = $this->kelahiranModel
            ->where('id_desa', $idDesa)
            ->where('MONTH(tgl_lahir)', (int) $bulan, false)
            ->where('YEAR(tgl_lahir)', (int) $tahun, false)
            ->countAllResults();

        $totalKematian = $this->kematianModel
            ->where('id_desa', $idDesa)
            ->countAllResults();

        $kematianBulanIni = $this->kematianModel
            ->where('id_desa', $idDesa)
            ->where('MONTH(tgl_kematian)', (int) $bulan, false)
            ->where('YEAR(tgl_kematian)', (int) $tahun, false)
            ->countAllResults();

        $dataLansia = $this->lansiaModel
            ->where('id_desa', $idDesa)
            ->findAll();