app/Controllers/AdminController.php

    public function index()
    {
        $db = \Config\Database::connect();

        $totalDesaAktif = $db->table('users')
            ->select('COUNT(DISTINCT id_desa) AS total_desa', false)
            ->where('role', 'ketua_pkk')
            ->where('status', 'approved')
            ->where('id_desa IS NOT NULL', null, false)
            ->get()
            ->getRowArray();

        $data = [
            'title' => 'Dashboard Admin Utama',

            'total_desa' => $totalDesaAktif['total_desa'] ?? 0,

            'total_pkk' => $this->userModel
                ->where('role', 'ketua_pkk')
                ->where('status', 'approved')
                ->countAllResults(),

            'total_user_pending' => $this->userModel
                ->where('role', 'ketua_pkk')
                ->where('status', 'pending')
                ->countAllResults(),
---
SELECT COUNT(DISTINCT id_desa) AS total_desa
FROM `users`
WHERE `role` = 'ketua_pkk'
AND `status` = 'approved'
AND id_desa IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'ketua_pkk'
AND `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'ketua_pkk'
AND `status` = 'pending'