app/Controllers/KelahiranController.php

SELECT `Kelahiran`.*, `PendudukDesa`.`nama` AS `nama_ibu`
FROM `Kelahiran`
LEFT JOIN `PendudukDesa` ON `PendudukDesa`.`nik` = `Kelahiran`.`nik_ibu` AND `PendudukDesa`.`id_desa` = `Kelahiran`.`id_desa`
WHERE `Kelahiran`.`id_desa` = '740221'
ORDER BY `Kelahiran`.`id_kelahiran` DESC
---
    public function index()
    {
        $idDesa = $this->getIdDesa();

        if (!$idDesa) {
            return redirect()
                ->to('/login')
                ->with('error', 'Sesi wilayah tidak ditemukan. Silakan login ulang.');
        }

        $kelahiran = $this->kelahiranModel
            ->select('Kelahiran.*, PendudukDesa.nama AS nama_ibu')
            ->join(
                'PendudukDesa',
                'PendudukDesa.nik = Kelahiran.nik_ibu AND PendudukDesa.id_desa = Kelahiran.id_desa',
                'left'
            )
            ->where('Kelahiran.id_desa', $idDesa)
            ->orderBy('Kelahiran.id_kelahiran', 'DESC')
            ->findAll();