app/Controllers/KematianController.php

SELECT *
FROM `Kematian`
WHERE `id_desa` = '740221'
ORDER BY `id_kematian` DESC
---
    public function index()
    {
        $idDesa = $this->getIdDesa();

        if (!$idDesa) {
            return redirect()
                ->to('/login')
                ->with('error', 'Sesi wilayah tidak ditemukan. Silakan login ulang.');
        }

        $kematian = $this->kematianModel
            ->where('id_desa', $idDesa)
            ->orderBy('id_kematian', 'DESC')
            ->findAll();