app/Controllers/LansiaController.php

SELECT Lansia.*,
                Lansia.produktifitas AS produktivitas,
                TIMESTAMPDIFF(YEAR, PendudukDesa.tgl_lahir, CURDATE()) AS umur
FROM `Lansia`
LEFT JOIN `PendudukDesa` ON `PendudukDesa`.`nik` = `Lansia`.`nik` AND `PendudukDesa`.`id_desa` = `Lansia`.`id_desa`
WHERE `Lansia`.`id_desa` = '740221'
ORDER BY `Lansia`.`id_lansia` DESC
---
    public function index()
    {
        $idDesa = $this->getIdDesa();

        if (!$idDesa) {
            return redirect()
                ->to('/login')
                ->with('error', 'Sesi wilayah tidak ditemukan. Silakan login ulang.');
        }

        $lansia = $this->lansiaModel
            ->select('
                Lansia.*,
                Lansia.produktifitas AS produktivitas,
                TIMESTAMPDIFF(YEAR, PendudukDesa.tgl_lahir, CURDATE()) AS umur
            ', false)
            ->join(
                'PendudukDesa',
                'PendudukDesa.nik = Lansia.nik AND PendudukDesa.id_desa = Lansia.id_desa',
                'left'
            )
            ->where('Lansia.id_desa', $idDesa)
            ->orderBy('Lansia.id_lansia', 'DESC')
            ->findAll();