app/Controllers/PkkController.php

    public function index()
    {
        $db = \Config\Database::connect();

        $idDesa = session()->get('id_desa');

        if (empty($idDesa)) {
            return redirect()
                ->to('/login')
                ->with('error', 'Sesi wilayah tidak ditemukan. Silakan login ulang.');
        }

        $desa = $db->table('desa')
            ->where('id_desa', $idDesa)
            ->get()
            ->getRowArray();

        $totalPenduduk = $db->table('PendudukDesa')
            ->where('id_desa', $idDesa)
            ->countAllResults();

        $totalLakiLaki = $db->table('PendudukDesa')
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'L')
            ->countAllResults();

        $totalPerempuan = $db->table('PendudukDesa')
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'P')
            ->countAllResults();

        $totalKelahiran = $db->table('Kelahiran')
            ->where('id_desa', $idDesa)
            ->countAllResults();

        $kelahiranLakiLaki = $db->table('Kelahiran')
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'L')
            ->countAllResults();

        $kelahiranPerempuan = $db->table('Kelahiran')
            ->where('id_desa', $idDesa)
            ->where('jenis_kelamin', 'P')
            ->countAllResults();

        $totalKematian = $db->table('Kematian')
            ->where('id_desa', $idDesa)
            ->countAllResults();

        $totalLansia = $db->table('Lansia')
            ->where('id_desa', $idDesa)
            ->countAllResults();

        $totalLansiaProduktif = $db->table('Lansia')
            ->where('id_desa', $idDesa)
            ->where("LOWER(produktifitas) = 'produktif'", null, false)
            ->countAllResults();

        $totalLansiaNonProduktif = max(0, $totalLansia - $totalLansiaProduktif);

        $pendudukPerRtRows = $db->table('PendudukDesa')
            ->select('RT, COUNT(*) AS total')
            ->where('id_desa', $idDesa)
            ->groupBy('RT')
            ->orderBy('RT', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `desa`
WHERE `id_desa` = 'DESA001'
SELECT COUNT(*) AS `numrows`
FROM `PendudukDesa`
WHERE `id_desa` = 'DESA001'
SELECT COUNT(*) AS `numrows`
FROM `PendudukDesa`
WHERE `id_desa` = 'DESA001'
AND `jenis_kelamin` = 'L'
SELECT COUNT(*) AS `numrows`
FROM `PendudukDesa`
WHERE `id_desa` = 'DESA001'
AND `jenis_kelamin` = 'P'
SELECT COUNT(*) AS `numrows`
FROM `Kelahiran`
WHERE `id_desa` = 'DESA001'
SELECT COUNT(*) AS `numrows`
FROM `Kelahiran`
WHERE `id_desa` = 'DESA001'
AND `jenis_kelamin` = 'L'
SELECT COUNT(*) AS `numrows`
FROM `Kelahiran`
WHERE `id_desa` = 'DESA001'
AND `jenis_kelamin` = 'P'
SELECT COUNT(*) AS `numrows`
FROM `Kematian`
WHERE `id_desa` = 'DESA001'
SELECT COUNT(*) AS `numrows`
FROM `Lansia`
WHERE `id_desa` = 'DESA001'
SELECT COUNT(*) AS `numrows`
FROM `Lansia`
WHERE `id_desa` = 'DESA001'
AND LOWER(produktifitas) = 'produktif'
SELECT `RT`, COUNT(*) AS total
FROM `PendudukDesa`
WHERE `id_desa` = 'DESA001'
GROUP BY `RT`
ORDER BY `RT` ASC

            $dataRt[]  = (int) ($row['total'] ?? 0);
        }

        $pendidikanRows = $db->table('PendudukDesa')
            ->select('pendidikan, COUNT(*) AS total')
            ->where('id_desa', $idDesa)
            ->groupBy('pendidikan')
            ->orderBy('total', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `pendidikan`, COUNT(*) AS total
FROM `PendudukDesa`
WHERE `id_desa` = 'DESA001'
GROUP BY `pendidikan`
ORDER BY `total` DESC