app/Controllers/RegisterController.php

        $registrationCode = 'REG-' . date('Ymd') . '-' . strtoupper(substr(bin2hex(random_bytes(4)), 0, 8));

        try {
            $inserted = $this->userModel->insert([
                'nama_lengkap'        => $namaLengkap,
                'email'               => $email,
                'username'            => $username,
                'password'            => password_hash($password, PASSWORD_DEFAULT),

                // id_desa tetap NULL sampai admin approve.
                'id_desa'             => null,

                // Data wilayah sementara dari pendaftaran.
                'requested_id_desa'   => $requestedIdDesa,
                'requested_nama_desa' => $requestedNamaDesa,

                'role'                => 'ketua_pkk',
                'status'              => 'pending',
                'registration_code'   => $registrationCode,
                'no_hp'               => $noHp,
                'jabatan'             => $jabatan,
                'alasan_pengajuan'    => $alasan,
            ]);
---
INSERT INTO `users` (`nama_lengkap`, `email`, `username`, `password`, `id_desa`, `requested_id_desa`, `requested_nama_desa`, `role`, `status`, `registration_code`, `no_hp`, `jabatan`, `alasan_pengajuan`, `created_at`, `updated_at`) VALUES ('Elizabet', 'elizabet@gmail.com', 'pkk_pkk', '$2y$10$bSOGE8nXv60m/8nXoct6HeCYvnxvwusc5O5C56lKa.byNbtvh0a9.', NULL, '3401080004', 'KALIREJO', 'ketua_pkk', 'pending', 'REG-20260530-6D7B2B53', '081246309768', 'Ketua PKK', '--', '2026-05-30 06:35:28', '2026-05-30 06:35:28')